
let state = {
    profilePage : {
        postData : [
            {id: 1, message: "получайте уведомления о статусе ваших откликов в телеграме, вконтакте или вайбере", likes: 15}
            , {id: 2, message: "but then you realize that you dont have a webcam", likes: 120},
            {
                id: 3,
                message: "Этот метод проверяет, удовлетворяет ли какой-либо элемент массива условию, заданному в передаваемой функции. Он вернет значение true, если хотя бы один элемент совпадет с проверяемой функцией, и значение false — если нет.",
                likes: 10
            },
            {
                id: 4,
                message: "Этот метод принимает функцию, которая имеет в качестве аргумента аккумулятор и значение. Он применяет функцию к аккумулятору и каждому значению массива, чтобы в результате вернуть только одно значение.",
                likes: 20
            },
            {
                id: 5,
                message: "Этот метод проверяет, удовлетворяют ли все элементы массива условию, заданному в передаваемой функции. Он вернет значение true, если каждый элемент совпадет с проверяемой функцией, и значение false — если нет.",
                likes: 12
            },
            {
                id: 6,
                message: "Этот метод принимает функцию в качестве параметра и создает новый массив с результатом вызова указанной функции для каждого элемента массива. Он всегда будет возвращать одинаковое количество элементов.",
                likes: 1240
            },
            {
                id: 7,
                message: "Этот метод принимает в качестве аргумента массив массивов и сглаживает вложенные массивы в массив верхнего уровня. Обратите внимание, что этот метод работает только для одного уровня.",
                likes: 0
            },
            {
                id: 8,
                message: "Этот метод принимает функцию в качестве параметра и возвращает новый массив, содержащий все элементы массива, для которого функция фильтрации передавалась в качестве аргумента, и возвращает ее со значением true.",
                likes: 1120
            },
            {id: 9, message: "Этот метод применяет функцию к каждому элементу массива.", likes: 3}
        ]
    },
    dialogPage : {
        messageData: [
            {id: 1, message: "Реально хороший и понятный курс. надеюсь это сказать и в конце."}
            , {id: 2, message: "Спасибо!"}
        ],
        dialogsData: [
            {id: 1, name: "Joseph Joestar"},
            {id: 2, name: 'Jonathan Joestar'},
            {id: 3, name: 'Jotaro kujo'},
            {id: 4, name: 'Johnny Joestar'},
            {id: 5, name: 'Johnny Joestar'},
            {id: 6, name: 'Johnny Joestar'},
            {id: 7, name: 'Johnny Joestar'}
        ]
    }
}

export {state};